---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsEnabled
source: html/17875d30-966d-bd5b-8ade-62b51760659b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeBendDiameterDimensionsEnabled Property

"Bend Diameter Dimensions"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsEnabled { get; }
```